/*********************************************************************
	@title:			构造函数&析构函数

	@description:		1、写一个含有构造函数、析构函数的类
				
				2、创建动态对象，调用构造函数
				
				3、用初始式对数据成员置值
			
				4、复制构造函数（浅复制、深复制）

	@author:		rh_Jameson

	@date:			2014/07/21
**********************************************************************/

#include<iostream>

#include "Date.h"
#include "CExample.h"
#include "Location.h"

using namespace std;

int main()
{
/*
	Date d ;
	d.SetDate(2014,07,21) ;
	d.PrintDate() ;	
*/

//---------------2、创建动态对象，调用构造函数-----------------//
//----------------3、用初始式对数据成员置值--------------------//

	//Date *pd = new (Date);
	//Date *pd = new Date;
	Date *pd = new Date(2014,07,21);		//函数调用中，初始式对数据成员置值
	
	//pd->SetDate(2001,10,1) ;     
	
	pd->PrintDate() ;
   
	delete pd ;

//----------------3、复制构造函数（浅复制、深复制）--------------------//
	/*自定义复制构造函数则为深复制*/


	CExample A(100);
    CExample B = A; //注意这里的对象初始化要调用默认拷贝构造函数，而非赋值
    B.Show ();
    

//----------------------------------------------------------//

	Location  C ( 1, 2 ) ;
	Location D ( C ) ;		
	cout << "D : " << D.GetX() << " , " << D.GetY() << endl ;
	
	return 0;
}